[
    {
        "sectionName": "Professional Summary",
        "subheadings": [
            {
                "rawText": [
                    "Proficient software engineer with \\textbf{2+} years of experience and expertise in core design principles, testing, and implementation. Adaptable and self-driven, demonstrating the capacity to rapidly acquire and implement new technologies and methodologies. Applied strong technical and collaborative skills through the completion of \\textbf{10+} self-initiated projects."
                ]
            }
        ]
    },
    {
        "sectionName": "Experience",
        "subheadings": [
            {
                "company": "Microsoft",
                "period": "May 2024 - July 2024",
                "position": "Software Engineering Intern",
                "location": "Redmond, WA",
                "resumeItems": [
                    "Engineered event-driven features in Dynamics CRM to streamline data center lease acquisition workflows, improving transparency and reducing operational costs by \\textbf{75%}.",
                    "Transitioned service authentication from client secrets to Managed Service Identity (MSI), enhancing security and reducing maintenance overhead by automating credential management."
                ]
            },
            {
                "company": "NCR Voyix",
                "period": "January 2024 - April 2024",
                "position": "Software Developer",
                "location": "Waterloo, ON",
                "resumeItems": [
                    "Developed a proxy server facilitating secure collaboration between remote tellers and clients, serving encrypted cloud static content to \\textbf{600+} financial institution branches and \\textbf{1000+} tellers.",
                    "Optimized bank teller UX, empowering clients to execute pivotal operations, like secure money transfers and interbranch chash shipments, by implementing real-time data streaming through WebSockets and reducing latency by \\textbf{99.9%}."
                ]
            },
            {
                "company": "Microsoft",
                "period": "May 2023 - August 2023",
                "position": "Software Engineering Intern",
                "location": "Redmond, WA",
                "resumeItems": [
                    "Migrated legacy dependencies to OpenTelemetry SDK, ensuring compliance with engineering excellence standards and mitigating security vulnerabilities.",
                    "Designed and implemented upstream system integration for data center lease acquisition applications, automating workflows and reducing manual processing costs by \\textbf{50%}."
                ]
            },
            {
                "company": "NCR",
                "period": "September 2022 - April 2023",
                "position": "Back-End Developer",
                "location": "Waterloo, ON",
                "resumeItems": [
                    "Built containerized banking microservices using Spring Boot, and NodeJS, improving scalability and deployment efficiency.",
                    "Optimized client-hardware communication for Teller Cash Recycler machines, reducing transaction processing by \\textbf{66%}."
                ]
            },
            {
                "company": "Scales Nature Park",
                "period": "May 2022 - August 2022",
                "position": "Full Stack Application Developer",
                "location": "Oro-Medonte, ON",
                "resumeItems": [
                    "Directed a team to design and develop MERN stack-based mobile and desktop applications, supporting wildlife conservation initiatives.",
                    "Collaborated with management and end-users to gather and prioritize application feature requirements, ensuring alignment with conservation goals."
                ]
            }
        ]
    },
    {
        "sectionName": "Technical Skills",
        "subheadings": [
            {
                "resumeItems": [
                    "\\textbf{Languages}: C, C# (.NET), Java (Spring Boot), TypeScript (NodeJS, NextJS, React Native), Python, Shell Script.",
                    "\\textbf{Tools}: MongoDB, Event-Driven (Kafka, Azure Service Bus), Firebase, Power Platform, REST APIs, Docker, Azure.",
                    "\\textbf{Techniques}: Distributed Systems Architecture, SOLID Design Patterns, Database Sharding & Replication, Agile."
                ]
            }
        ]
    },
    {
        "sectionName": "Projects",
        "subheadings": [
            {
                "company": "Plant Together",
                "period": "January 2025 - April 2025",
                "techstack": "React, NodeJS, PSQL, Firebase, Socket.io",
                "resumeItems": [
                    "Empowered \\textbf{50+} software architects to collaborate on PlantUML diagrams in real-time using a WebSocket solution.",
                    "Secured client architecture artifacts with a robust access control system powered by Firebase authentication."
                ]
            },
            {
                "company": "SVG Parser Web Application",
                "period": "January 2022 - March 2022",
                "techstack": "C, HTML, CSS, JavaScript",
                "resumeItems": [
                    "Developed an interactive web GUI to facilitate seamless data exchange between users and the server.",
                    "Built core SVG parsing library in C, adhering to strict API specifications and maintaining \\textbf{zero} memory leaks."
                ]
            }
        ]
    },
    {
        "sectionName": "Education",
        "subheadings": [
            {
                "company": "University of Guelph",
                "period": "September 2020 - April 2025",
                "position": "Bachelor of Computing, Honors Co-op Major Software Engineering Minor Marketing",
                "location": "Guelph, ON"
            }
        ]
    }
]