[
    {
        "sectionName": "Professional Summary",
        "subheadings": [
            {
                "rawText": "Professional with a passion for technology and innovation. Experienced in building scalable cloud solutions, developing embedded systems, and optimizing machine learning algorithms. Strong problem-solving and communication skills with a proven track record of delivering high-impact projects. Looking to leverage my expertise in cloud architecture and data engineering to drive business growth and innovation."
            }
        ]
    },
    {
        "sectionName": "Experience",
        "subheadings": [
            {
                "company": "Amazon Web Services (AWS)",
                "period": "June 2022 - September 2023",
                "position": "Cloud Solutions Engineer",
                "location": "Seattle, WA",
                "resumeItems": [
                    "Led the design and implementation of a high-performance serverless architecture for multi-region deployment, reducing latency by \\textbf{30%} and improving user engagement by \\textbf{25%}.",
                    "Enhanced security compliance by automating access policies and deploying infrastructure monitoring with AWS CloudTrail and GuardDuty, resulting in a \\textbf{70%} reduction in security incident response time.",
                    "Built a customer analytics dashboard using Amazon QuickSight and Redshift, enabling real-time insights that improved customer satisfaction scores by \\textbf{15%}."
                ]
            },
            {
                "company": "Tesla",
                "period": "September 2021 - May 2022",
                "position": "Embedded Systems Developer",
                "location": "Palo Alto, CA",
                "resumeItems": [
                    "Developed and optimized firmware for in-vehicle infotainment systems, improving media response time by \\textbf{40%} and minimizing system crashes.",
                    "Designed and tested secure Over-the-Air (OTA) update functionality, increasing update reliability by \\textbf{85%} and reducing downtime during software patches."
                ]
            },
            {
                "company": "Spotify",
                "period": "January 2021 - August 2021",
                "position": "Software Engineer, Machine Learning",
                "location": "New York, NY",
                "resumeItems": [
                    "Engineered a recommendation system using collaborative filtering and neural networks, increasing monthly user retention by \\textbf{20%}.",
                    "Implemented A/B testing frameworks that enabled rapid experimentation across recommendation models, reducing testing time by \\textbf{50%}."
                ]
            }
        ]
    },
    {
        "sectionName": "Technical Skills",
        "subheadings": [
            {
                "resumeItems": [
                    "\\textbf{Languages}: Python, JavaScript, Java, C++, Go, SQL, TypeScript.",
                    "\\textbf{Frameworks and Libraries}: Django, Flask, React, Node.js, TensorFlow, PyTorch.",
                    "\\textbf{Tools and Platforms}: AWS, GCP, Docker, Kubernetes, Jenkins, Terraform.",
                    "\\textbf{Techniques}: Machine Learning, Data Engineering, Cloud Architecture, Distributed Systems, Microservices."
                ]
            }
        ]
    },
    {
        "sectionName": "Projects",
        "subheadings": [
            {
                "company": "Real-Time Traffic Monitoring System",
                "period": "October 2022 - February 2023",
                "techstack": "Python, AWS",
                "resumeItems": [
                    "Developed a traffic monitoring system using computer vision algorithms in Python, achieving \\textbf{95%} accuracy in vehicle detection.",
                    "Deployed the system on AWS with Lambda and S3 for scalable image processing, reducing processing costs by \\textbf{40%}."
                ]
            },
            {
                "company": "Personal Finance Tracker",
                "period": "July 2021 - September 2021",
                "techstack": "React Native, Firestore",
                "resumeItems": [
                    "Created a mobile application in React Native for tracking personal finances, with secure data storage using Firebase Authentication and Firestore.",
                    "Integrated data visualization features to provide users with monthly spending insights, improving financial literacy for over 500 users."
                ]
            }
        ]
    },
    {
        "sectionName": "Education",
        "subheadings": [
            {
                "company": "University of California, Berkeley",
                "period": "September 2017 - May 2021",
                "position": "Bachelor of Science in Computer Science",
                "location": "Berkeley, CA",
                "resumeItems": [
                    "Graduated with honors, GPA: 3.8/4.0",
                    "Relevant coursework: Data Structures and Algorithms, Machine Learning, Cloud Computing, Distributed Systems"
                ]
            }
        ]
    }
]