[
    {
        "sectionName": "Experience",
        "subheadings": [
            {
                "company": "Microsoft",
                "period": "May 2024 - July 2024",
                "position": "Software Engineering Intern",
                "location": "Redmond, WA",
                "resumeItems": [
                    "Developed partner engagement and event-driven features within Dynamics CRM to optimize data center lease acquisition processes, enhancing transparency and reducing business costs by \\textbf{75%}",
                    "Migrated service authentication using client secrets to Managed Service Identity (MSI), eliminating security risks and maintenance overhead."
                ]
            },
            {
                "company": "NCR Voyix",
                "period": "January 2024 - April 2024",
                "position": "Software Developer",
                "location": "Waterloo, ON",
                "resumeItems": [
                    "Fascilitated a robust suite of collaboration services between remote tellers and clients by developing a proxy server that serves encrypted cloud static content.",
                    "Optimized bank teller UX to empower clients to execute pivotal operations, like secure money transfers and interbranch chash shipments, by implementing real-time data streaming through WebSockets and reducing latency by \\textbf{99.9%}."
                ]
            },
            {
                "company": "Microsoft",
                "period": "May 2023 - August 2023",
                "position": "Software Engineering Intern",
                "location": "Redmond, WA",
                "resumeItems": [
                    "Delivered engineering excellence compliance requirements through OpenTelemetry Sdk migration, eliminating security risks posed by as-is dependencies.",
                    "Architected and delivered an upstream system integration between data center lease acquisition applications, reducing manual business processes' costs by \\textbf{50%}."
                ]
            },
            {
                "company": "NCR",
                "period": "September 2022 - April 2023",
                "position": "Back-End Developer",
                "location": "Waterloo, ON",
                "resumeItems": [
                    "Designed and implemented a set of containerized banking micro-services using in-house tools with YAML, Spring boot and NodeJS.",
                    "Improved the efficiency of client-hardware communication on Teller Cash Recycler machines by \\textbf{66%}."
                ]
            },
            {
                "company": "Scales Nature Park",
                "period": "May 2022 - August 2022",
                "position": "Full Stack Application Developer",
                "location": "Oro-Medonte, ON",
                "resumeItems": [
                    "Led a small team through the research, design, and development of mobile and desktop applications in the “MERN” stack for wildlife conservation purposes.",
                    "Coordinated with management and the employee user base to gather application feature requirements."
                ]
            }
        ]
    },
    {
        "sectionName": "Highlights of Qualifications",
        "subheadings": [
            {
                "resumeItems": [
                    "Strong knowledge of software engineering concepts, design, testing, and implementation.",
                    "Self-motivated, quick learner, and able to adapt to modern technologies, concepts, and situations.",
                    "Excellent analytical and problem-solving skills proven through self-led projects.",
                    "Effective communication, interpersonal and teamwork skills."
                ]
            }
        ]
    },
    {
        "sectionName": "Technical Skills",
        "subheadings": [
            {
                "resumeItems": [
                    "\\textbf{Languages}: C, C# (.NET), Java (Spring Boot), JavaScript (NodeJS, NextJS, React Native), Python, Batch.",
                    "\\textbf{Tools}: MongoDB, Event-Driven (Kafka, Azure Service Bus), Power Platform, REST APIs, Docker, Azure.",
                    "\\textbf{Techniques}: Distributed Systems Architecture, SOLID Design Patterns, Database Sharding & Replication, Agile."
                ]
            }
        ]
    },
    {
        "sectionName": "Projects",
        "subheadings": [
            {
                "company": "SVG Parser Web Application",
                "period": "January 2022 - March 2022",
                "techstack": "C, HTML, CSS, JavaScript",
                "resumeItems": [
                    "Designed and employed an interactive web GUI that exchanges user data with the server.",
                    "Implemented SVG parsing libraries written in C, adhering to API specifications."
                ]
            },
            {
                "company": "Automated Course Registration",
                "period": "May 2021 - December 2021",
                "techstack": "Python, Selenium",
                "resumeItems": [
                    "Developed a course registration automation web bot using the Selenium API and Python."
                ]
            }
        ]
    },
    {
        "sectionName": "Education",
        "subheadings": [
            {
                "company": "University of Guelph",
                "period": "September 2020 - Present",
                "position": "Bachelor of Computing, Honors Co-op Major Software Engineering Minor Marketing",
                "location": "Guelph, ON"
            }
        ]
    }
]